src/Catalogs/Scan_СпециальныеУсловия/Scan_СпециальныеУсловия.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Scan_СпециальныеУсловия</name>
  <basedOn>Catalog.Scan_СпециальныеУсловия</basedOn>
  <attributes>
    <name>DeliveryDate</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>DistributorNet</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>FFU</name>
    <type>
      <types>CatalogRef.Scan_ОпцииПродуктов</types>
    </type>
  </attributes>
  <attributes>
    <name>IDПродуктаКП</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>RUНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>SORDER</name>
    <type>
      <types>CatalogRef.Scan_ОпцииПродуктов</types>
    </type>
  </attributes>
  <attributes>
    <name>Дилер</name>
    <type>
      <types>CatalogRef.Scan_Компании</types>
    </type>
  </attributes>
  <attributes>
    <name>ДрайвНеПрименим</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КодСУSOWA</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоПрикрепленныхШасси</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоПродуктов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоммерческоеПредложениеSPORT</name>
    <type>
      <types>CatalogRef.Scan_КоммерческиеПредложения</types>
    </type>
  </attributes>
  <attributes>
    <name>КонечныйКлиент</name>
    <type>
      <types>CatalogRef.Scan_Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>КонечныйКлиентКомпания</name>
    <type>
      <types>CatalogRef.Scan_Компании</types>
    </type>
  </attributes>
  <attributes>
    <name>МаржаДилера</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МаржаДист</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Модель</name>
    <type>
      <types>CatalogRef.Scan_МоделиПродуктов</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерКоммерческогоПредложенияSPORT</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Обоснование</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>CatalogRef.Scan_СпециальныеУсловия</types>
    </type>
  </attributes>
  <attributes>
    <name>ПрайсCustomerPrice</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПрайсDealerNet</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПрайсМаржаDealer</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПрайсМаржаDist</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПродавецДилера</name>
    <type>
      <types>CatalogRef.Scan_КонтактныеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>СебестоимостьСНДС</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СпецCustomerPrice</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СпецDealerNet</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СпецМаржаDealer</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СпецМаржаDist</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СрокДействияСпециальныхУсловий</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтавкаНДС</name>
    <type>
      <types>CatalogRef.Scan_СтавкиНДС</types>
    </type>
  </attributes>
  <attributes>
    <name>СтандартнаяСпецификация</name>
    <type>
      <types>DocumentRef.Scan_СпецификацияСтандартнойМодели</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>CatalogRef.Scan_СтатусыСоглашенийОПоставкеИСпециальныхУсловий</types>
    </type>
  </attributes>
  <attributes>
    <name>СУНаАвтобусы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УникальностьСпецификации</name>
    <type>
      <types>EnumRef.Scan_ТипыСпецификации</types>
    </type>
  </attributes>
  <attributes>
    <name>ЦенаБезНДС</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЦенаДляДилера</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЦенаДляКлиента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЦенаДляКлиентаБезНДС</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>СписокПродуктов</name>
    <attributes>
      <name>Продукт</name>
      <type>
        <types>CatalogRef.Scan_Изделия</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>УсловияОплаты</name>
    <attributes>
      <name>ПроцентОплаты</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СрокОплатыАванса</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидОплаты</name>
      <type>
        <types>EnumRef.Scan_ВидыОплат</types>
      </type>
    </attributes>
    <attributes>
      <name>КрайняяДатаОплаты</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РасчетДатыОплаты</name>
      <type>
        <types>EnumRef.Scan_ВидыРасчетаДатыОплаты</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Цены</name>
    <attributes>
      <name>ТипЦены</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>МаржаDist</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>DealerNet</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>МаржаDealer</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>CustomerPrice</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТекстСообщения</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Пользователь</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>Статус</name>
      <type>
        <types>CatalogRef.Scan_СтатусыСоглашенийОПоставкеИСпециальныхУсловий</types>
      </type>
    </attributes>
    <attributes>
      <name>Период</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>DeliveryDate</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СрокДействияСпециальныхУсловий</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоПродуктов</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/Catalogs/Scan_СтатусыСоглашенийОПоставкеИСпециальныхУсловий/Scan_СтатусыСоглашенийОПоставкеИСпециальныхУсловий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Scan_СтатусыСоглашенийОПоставкеИСпециальныхУсловий</name>
  <predefined>
    <items>
      <name>Запрос</name>
      <description>Запрос</description>
    </items>
    <items>
      <name>ЗапросНаИзменениеСОП</name>
      <description>Запрос на изменение СОП</description>
    </items>
    <items>
      <name>ЗаявкаНаСклад</name>
      <description>Заявка на склад</description>
    </items>
    <items>
      <name>ЗаявкаНаСОП</name>
      <description>Заявка на СОП</description>
    </items>
    <items>
      <name>КРазмещению</name>
      <description>К размещению</description>
    </items>
    <items>
      <name>НачатоОформлениеСОП</name>
      <description>Начато оформление СОП</description>
    </items>
    <items>
      <name>НеактуальноЕстьДС</name>
      <description>Неактуально. Есть ДС</description>
    </items>
    <items>
      <name>ОбработкаЗавершена</name>
      <description>Обработка завершена</description>
    </items>
    <items>
      <name>Одобрено</name>
      <description>Одобрено</description>
    </items>
    <items>
      <name>ОдобреноЕстьВСОП</name>
      <description>Одобрено, есть в СОП</description>
    </items>
    <items>
      <name>ОдобреноНетВСОП</name>
      <description>Одобрено, нет в СОП</description>
    </items>
    <items>
      <name>Отказ</name>
      <description>Отказ</description>
    </items>
    <items>
      <name>Отменена</name>
      <description>Отменена</description>
    </items>
    <items>
      <name>Пересмотр</name>
      <description>Пересмотр</description>
    </items>
    <items>
      <name>ПроектЗаявкиНаСОП</name>
      <description>Проект заявки на СОП</description>
    </items>
    <items>
      <name>Согласование</name>
      <description>Согласование</description>
    </items>
    <items>
      <name>СОП_Исполнен</name>
      <description>СОП исполнен</description>
    </items>
    <items>
      <name>СОП_ИсполненЧастично</name>
      <description>СОП исполнен частично</description>
    </items>
    <items>
      <name>СОП_Отменен</name>
      <description>СОП отменен</description>
    </items>
    <items>
      <name>СОП_Оформлен</name>
      <description>СОП Оформлен</description>
    </items>
    <items>
      <name>СОП_Расторгнут</name>
      <description>СОП расторгнут</description>
    </items>
    <items>
      <name>Черновик</name>
      <description>Черновик</description>
    </items>
  </predefined>
  <attributes>
    <name>ИспользуетсяВСоглашенииОПоставке</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользуетсяВСпециальныхУсловиях</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользуетсяВТипеЗаявкаНаСОП</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользуетсяВТипеЗаявкаНаСклад</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>IDExternalSystem</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИспользуетсяВТипеЗаявкаНаСОПSRU</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ИспользованиеВ</name>
    <attributes>
      <name>ТипСоглашенияОПоставке</name>
      <type>
        <types>EnumRef.Scan_ТипыСоглашенийОПоставке</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/Catalogs/Scan_СпециальныеУсловия/ManagerModule.bsl
Функция ПолучитьСписокЭлементовДляНастройки() Экспорт
	
	ТаблицаЭлементов = Новый ТаблицаЗначений;
	КС = Новый КвалификаторыСтроки(100);
	Массив = Новый Массив;
	Массив.Добавить(Тип("Строка"));
	ОписаниеТиповС = Новый ОписаниеТипов(Массив, , КС);
	ТаблицаЭлементов.Колонки.Добавить("ИмяЭлемента",ОписаниеТиповС,,); 
	
	// добавление реквизитов /ТЧ
	СтрокаТЗ = ТаблицаЭлементов.Добавить(); 
	СтрокаТЗ.ИмяЭлемента  = "КоличествоПродуктов";
	СтрокаТЗ = ТаблицаЭлементов.Добавить(); 
	СтрокаТЗ.ИмяЭлемента  = "Дилер";
	СтрокаТЗ = ТаблицаЭлементов.Добавить(); 
	СтрокаТЗ.ИмяЭлемента  = "ПродавецДилера";
	СтрокаТЗ = ТаблицаЭлементов.Добавить(); 
	СтрокаТЗ.ИмяЭлемента  = "Модель";
	СтрокаТЗ = ТаблицаЭлементов.Добавить(); 
	СтрокаТЗ.ИмяЭлемента  = "УникальностьСпецификации";
	СтрокаТЗ = ТаблицаЭлементов.Добавить(); 
	СтрокаТЗ.ИмяЭлемента  = "СтандартнаяСпецификация";
	СтрокаТЗ = ТаблицаЭлементов.Добавить(); 
	СтрокаТЗ.ИмяЭлемента  = "НомерКоммерческогоПредложенияSPORT";
	СтрокаТЗ = ТаблицаЭлементов.Добавить(); 
	СтрокаТЗ.ИмяЭлемента  = "ЦенаДляДилера";
	СтрокаТЗ = ТаблицаЭлементов.Добавить(); 
	СтрокаТЗ.ИмяЭлемента  = "ЦенаДляКлиента";
	СтрокаТЗ = ТаблицаЭлементов.Добавить(); 
	СтрокаТЗ.ИмяЭлемента  = "DeliveryDate";
	СтрокаТЗ = ТаблицаЭлементов.Добавить(); 
	СтрокаТЗ.ИмяЭлемента  = "SORDER";
	СтрокаТЗ = ТаблицаЭлементов.Добавить(); 
	СтрокаТЗ.ИмяЭлемента  = "FFU";
	СтрокаТЗ = ТаблицаЭлементов.Добавить(); 
	СтрокаТЗ.ИмяЭлемента  = "КонечныйКлиент";
	СтрокаТЗ = ТаблицаЭлементов.Добавить(); 
	СтрокаТЗ.ИмяЭлемента  = "DistributorNet";
	СтрокаТЗ = ТаблицаЭлементов.Добавить(); 
	СтрокаТЗ.ИмяЭлемента  = "СебестоимостьСНДС";
	СтрокаТЗ = ТаблицаЭлементов.Добавить(); 
	СтрокаТЗ.ИмяЭлемента  = "RUНомер";
	СтрокаТЗ = ТаблицаЭлементов.Добавить(); 
	СтрокаТЗ.ИмяЭлемента  = "СписокПродуктов";
	СтрокаТЗ = ТаблицаЭлементов.Добавить(); 
	СтрокаТЗ.ИмяЭлемента  = "УсловияОплаты";
	СтрокаТЗ = ТаблицаЭлементов.Добавить(); 
	СтрокаТЗ.ИмяЭлемента  = "Цены";
	СтрокаТЗ = ТаблицаЭлементов.Добавить(); 
	СтрокаТЗ.ИмяЭлемента  = "СрокДействияСпециальныхУсловий";     
	СтрокаТЗ = ТаблицаЭлементов.Добавить(); 
	СтрокаТЗ.ИмяЭлемента  = "ГруппаМаржаDist";   
	СтрокаТЗ = ТаблицаЭлементов.Добавить(); 
	СтрокаТЗ.ИмяЭлемента  = "Обоснование";
	//vikhle 05.08.2020 mt 16181 +++
	СтрокаТЗ = ТаблицаЭлементов.Добавить(); 
	СтрокаТЗ.ИмяЭлемента  = "ДрайвНеПрименим";
	СтрокаТЗ = ТаблицаЭлементов.Добавить();
	СтрокаТЗ.ИмяЭлемента  = "СтавкаНДС";
	СтрокаТЗ = ТаблицаЭлементов.Добавить(); 
	СтрокаТЗ.ИмяЭлемента  = "ЦенаБезНДС";
	СтрокаТЗ = ТаблицаЭлементов.Добавить(); 
	СтрокаТЗ.ИмяЭлемента  = "Основание";
	//СтрокаТЗ = ТаблицаЭлементов.Добавить();//rarus bonmak 13.01.2021 17041 
	//СтрокаТЗ.ИмяЭлемента  = "ОтсрочкаПлатежа";//rarus bonmak 13.01.2021 17041
	//vikhle 05.08.2020 mt 16181 ---
	СтрокаТЗ = ТаблицаЭлементов.Добавить(); //rarus vikhle 29.01.2021 mt 16929
	СтрокаТЗ.ИмяЭлемента  = "Примечание"; //rarus vikhle 29.01.2021 mt 16929 
	
	СтрокаТЗ = ТаблицаЭлементов.Добавить(); 
	СтрокаТЗ.ИмяЭлемента  = "ПрайсDealerNet";
	СтрокаТЗ = ТаблицаЭлементов.Добавить(); 
	СтрокаТЗ.ИмяЭлемента  = "СпецDealerNet";
	СтрокаТЗ = ТаблицаЭлементов.Добавить(); 
	СтрокаТЗ.ИмяЭлемента  = "ПрайсCustomerPrice";
	СтрокаТЗ = ТаблицаЭлементов.Добавить(); 
	СтрокаТЗ.ИмяЭлемента  = "СпецCustomerPrice";
	СтрокаТЗ = ТаблицаЭлементов.Добавить(); 
	СтрокаТЗ.ИмяЭлемента  = "КонечныйКлиентКомпания";	
	СтрокаТЗ = ТаблицаЭлементов.Добавить(); 
	СтрокаТЗ.ИмяЭлемента  = "Комментарий";	
	
	//rarus vikhle 17.12.2020 mt 16181 +++
	СтрокаТЗ = ТаблицаЭлементов.Добавить(); 
	СтрокаТЗ.ИмяЭлемента  = "ЦенаДляКлиентаБезНДС";
	//rarus vikhle 17.12.2020 mt 16181 ---
	
	//rarus ozhnik 15888 31.08.2020 + 
	СтрокаТЗ = ТаблицаЭлементов.Добавить(); 
	СтрокаТЗ.ИмяЭлемента  = "Код";
	СтрокаТЗ = ТаблицаЭлементов.Добавить(); 
	СтрокаТЗ.ИмяЭлемента  = "Статус";
	//rarus ozhnik 15888 31.08.2020 -
	//rarus ozhnik 16453 07.09.2020 + 
	СтрокаТЗ = ТаблицаЭлементов.Добавить(); 
	СтрокаТЗ.ИмяЭлемента  = "ГруппаСистемныеПоля";
	СтрокаТЗ = ТаблицаЭлементов.Добавить(); 
	СтрокаТЗ.ИмяЭлемента  = "КоммерческоеПредложениеSPORT";
	СтрокаТЗ = ТаблицаЭлементов.Добавить(); 
	СтрокаТЗ.ИмяЭлемента  = "IDПродуктаКП";
	СтрокаТЗ = ТаблицаЭлементов.Добавить(); 
	СтрокаТЗ.ИмяЭлемента  = "ДекорацияСпецификация";  	
	//rarus ozhnik 16453 07.09.2020 -
	
	СтрокаТЗ = ТаблицаЭлементов.Добавить(); 
	СтрокаТЗ.ИмяЭлемента  = "Запросить";
	СтрокаТЗ = ТаблицаЭлементов.Добавить(); 
	СтрокаТЗ.ИмяЭлемента  = "НаСогласование";
	СтрокаТЗ = ТаблицаЭлементов.Добавить(); 
	СтрокаТЗ.ИмяЭлемента  = "Пересмотр";
	СтрокаТЗ = ТаблицаЭлементов.Добавить(); 
	СтрокаТЗ.ИмяЭлемента  = "Одобрить";
	СтрокаТЗ = ТаблицаЭлементов.Добавить(); 
	СтрокаТЗ.ИмяЭлемента  = "Отклонить";
	СтрокаТЗ = ТаблицаЭлементов.Добавить(); 
	СтрокаТЗ.ИмяЭлемента  = "Подобрать";

	//rarus ozhnik 16453 07.09.2020 + 
	СтрокаТЗ = ТаблицаЭлементов.Добавить(); 
	СтрокаТЗ.ИмяЭлемента  = "ЗагрузитьКП";
	//rarus ozhnik 16453 07.09.2020 -

	// rarus tenkam 19.01.2021 mantis 16345 +++
	СтрокаТЗ = ТаблицаЭлементов.Добавить(); 
	СтрокаТЗ.ИмяЭлемента  = "КодСУSOWA";
	СтрокаТЗ = ТаблицаЭлементов.Добавить(); 
	СтрокаТЗ.ИмяЭлемента  = "КоличествоПрикрепленныхШасси";
	// rarus tenkam 19.01.2021 mantis 16345 ---
	
	//rarus tenkam 16.06.2021 mantis 17742 +++ 
	СтрокаТЗ = ТаблицаЭлементов.Добавить(); 
	СтрокаТЗ.ИмяЭлемента  = "СУНаАвтобусы";
	//rarus tenkam 16.06.2021 mantis 17742 --- 
	
	возврат ТаблицаЭлементов;
КонецФункции

Процедура ОбновитьСУ(ТаблицаДоИзменений,ТаблицаПослеИзменений) Экспорт
	//rarus vikhle 26.01.2021 mt 16929 +++	
	//Получим общий список СУ до и после изменений
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТаблицаДоИзменений.СпециальныеУсловия КАК СпециальныеУсловия
	               |ПОМЕСТИТЬ СУДоИзменений
	               |ИЗ
	               |	&ТаблицаДоИзменений КАК ТаблицаДоИзменений
	               |ГДЕ
	               |	НЕ ТаблицаДоИзменений.СпециальныеУсловия = ЗНАЧЕНИЕ(Справочник.Scan_СпециальныеУсловия.ПустаяСсылка)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ТаблицаПослеИзменений.СпециальныеУсловия КАК СпециальныеУсловия
	               |ПОМЕСТИТЬ СУПослеИзменений
	               |ИЗ
	               |	&ТаблицаПослеИзменений КАК ТаблицаПослеИзменений
	               |ГДЕ
	               |	НЕ ТаблицаПослеИзменений.СпециальныеУсловия = ЗНАЧЕНИЕ(Справочник.Scan_СпециальныеУсловия.ПустаяСсылка)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	СУДоИзменений.СпециальныеУсловия КАК СпециальныеУсловия
	               |ИЗ
	               |	СУДоИзменений КАК СУДоИзменений
	               |
	               |ОБЪЕДИНИТЬ
	               |
	               |ВЫБРАТЬ
	               |	СУПослеИзменений.СпециальныеУсловия
	               |ИЗ
	               |	СУПослеИзменений КАК СУПослеИзменений";
	Запрос.УстановитьПараметр("ТаблицаДоИзменений",ТаблицаДоИзменений);			   
	Запрос.УстановитьПараметр("ТаблицаПослеИзменений",ТаблицаПослеИзменений);
	ТаблицаСУ = Запрос.Выполнить().Выгрузить();
	//Получим количество применений СУ в актуальных заявках
	ТаблицаПримененийСУ = ПолучитьКоличествоПримененийСУ(ТаблицаСУ);
	
	СтатусОдобреноЕстьВСОП = Справочники.Scan_СтатусыСоглашенийОПоставкеИСпециальныхУсловий.ОдобреноЕстьВСОП;
	СтатусОдобреноНетВСОП  = Справочники.Scan_СтатусыСоглашенийОПоставкеИСпециальныхУсловий.ОдобреноНетВСОП; 
	//Обновим статус в СУ при необходимости
	Для Каждого СтрокаТЗ Из ТаблицаПримененийСУ Цикл
		Если СтрокаТЗ.Статус =  СтатусОдобреноЕстьВСОП	И СтрокаТЗ.КоличествоПрименений = 0 Тогда
			СУЗаписаны = УстановитьСтатусСУ(СтрокаТЗ.СпециальныеУсловия,СтатусОдобреноНетВСОП);
		ИначеЕсли СтрокаТЗ.Статус =  СтатусОдобреноНетВСОП И СтрокаТЗ.КоличествоПрименений > 0 Тогда  
			СУЗаписаны = УстановитьСтатусСУ(СтрокаТЗ.СпециальныеУсловия,СтатусОдобреноЕстьВСОП);	
		КонецЕсли;		
	КонецЦикла;
	
	//rarus vikhle 26.01.2021 mt 16929 ---
КонецПроцедуры

// Возвращает таблицу значений с переданными СУ, статусом и количеством применений в заявках на СОП (в актуальном статусе),
// в которых указаны переданные СУ.
Функция ПолучитьКоличествоПримененийСУ(СУ) Экспорт
	
	//rarus vikhle 26.01.2021 mt 16929 +++
	//Массив статусов, которые не учитываются при подсчете  
	МассивСтатусов = Новый Массив;
	МассивСтатусов.Добавить(Справочники.Scan_СтатусыСоглашенийОПоставкеИСпециальныхУсловий.НеактуальноЕстьДС);
	МассивСтатусов.Добавить(Справочники.Scan_СтатусыСоглашенийОПоставкеИСпециальныхУсловий.СОП_Отменен);
	МассивСтатусов.Добавить(Справочники.Scan_СтатусыСоглашенийОПоставкеИСпециальныхУсловий.СОП_Расторгнут);
	МассивСтатусов.Добавить(Справочники.Scan_СтатусыСоглашенийОПоставкеИСпециальныхУсловий.Отказ);

	Запрос  = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Scan_СпециальныеУсловия.Ссылка КАК СпециальныеУсловия,
	               |	ЕСТЬNULL(СУММА(Scan_СоглашенияОПоставкеСписокПродуктов.Количество), 0) КАК КоличествоПрименений,
	               |	Scan_СпециальныеУсловия.Статус КАК Статус
	               |ИЗ
	               |	Справочник.Scan_СпециальныеУсловия КАК Scan_СпециальныеУсловия
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Scan_СоглашенияОПоставке.СписокПродуктов КАК Scan_СоглашенияОПоставкеСписокПродуктов
	               |		ПО (Scan_СоглашенияОПоставкеСписокПродуктов.СпециальныеУсловия = Scan_СпециальныеУсловия.Ссылка)
	               |			И (НЕ Scan_СоглашенияОПоставкеСписокПродуктов.Ссылка.Статус В (&МассивСтатусов))
	               |ГДЕ
	               |	Scan_СпециальныеУсловия.Ссылка В(&СУ)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	Scan_СоглашенияОПоставкеСписокПродуктов.СпециальныеУсловия,
	               |	Scan_СпециальныеУсловия.Ссылка,
	               |	Scan_СпециальныеУсловия.Статус";
	Запрос.УстановитьПараметр("МассивСтатусов",МассивСтатусов);
	Запрос.УстановитьПараметр("СУ",СУ);
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	Возврат РезультатЗапроса;
	//rarus vikhle 26.01.2021 mt 16929 ---
	
КонецФункции

Функция УстановитьСтатусСУ(СУ,Статус) Экспорт
	//rarus vikhle 26.01.2021 mt 16929 +++
	СУОбъект = СУ.ПолучитьОбъект();
	СУОбъект.Статус = Статус;
	
	//Добавление строки в служебную ТЧ Цены
	нСтрокаТЧ 									= СУОбъект.Цены.Добавить();
	нСтрокаТЧ.CustomerPrice 					= СУОбъект.СпецCustomerPrice;
	нСтрокаТЧ.DealerNet 						= СУОбъект.СпецDealerNet; 
	нСтрокаТЧ.Статус 							= СУОбъект.Статус;
	нСтрокаТЧ.Период 							= ТекущаяДатаСеанса();
	нСтрокаТЧ.Пользователь 						= ПараметрыСеанса.ТекущийПользователь;
	нСтрокаТЧ.DeliveryDate 						= СУОбъект.DeliveryDate;
	нСтрокаТЧ.СрокДействияСпециальныхУсловий	= СУОбъект.СрокДействияСпециальныхУсловий;
	нСтрокаТЧ.КоличествоПродуктов 				= СУОбъект.КоличествоПродуктов;
	
	Попытка
		СУОбъект.Записать();
		ВывестиСообщениеПол(Нстр("ru = 'У специальных условий № %1 установлен статус ""%2""'"),,,,,СУ,Статус);
		Возврат Истина;
	Исключение
		ВывестиСообщениеПол(Нстр("ru = 'Произошла ошибка при записи специальных условий %1: '" + ОписаниеОшибки()),,,,,СУОбъект.Ссылка);
		ЗаписьЖурналаРегистрации(Нстр("ru = 'Произошла ошибка при записи специальных условий %1: '"),
								УровеньЖурналаРегистрации.Ошибка,,СУОбъект.Ссылка,Нстр("ru = 'Произошла ошибка при записи специальных условий: '" + ОписаниеОшибки()));
		Возврат Ложь;							
	КонецПопытки;								
	//rarus vikhle 26.01.2021 mt 16929 ---
	
КонецФункции	

//rarus vikhle 28.02.2021 mt 17186 +++
Функция ПродуктВходитВСУ(Продукт,СУ) Экспорт
	
	Возврат НЕ СУ.СписокПродуктов.Найти(Продукт) = Неопределено;
	
КонецФункции
//rarus vikhle 28.02.2021 mt 17186 ---
